# Homebrew taps
tap "oven-sh/bun"
tap "sourcegraph/src-cli"
tap "tw93/tap"
tap "withgraphite/tap"

# Homebrew Cask applications
cask "1password"
cask "1password-cli"
cask "alcove"
cask "balsamiq-wireframes"
cask "brave-browser"
cask "bruno"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "clop"
cask "cmux"
cask "cursor"
cask "devtoys"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "gpg-suite"
cask "handbrake-app"
cask "iina"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "keka"
cask "loom"
cask "monitorcontrol"
cask "notion"
cask "numi"
cask "one-switch"
cask "pronotes"
cask "raycast"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tradingview"
cask "visual-studio-code"
cask "whatsapp"

# Homebrew formulae
brew "ansible"
brew "antidote"
brew "awscli"
brew "bat"
brew "btop"
brew "coursier"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-delta"
brew "github-mcp-server"
brew "gnupg"
brew "go"
brew "googleworkspace-cli"
brew "gradle"
brew "helm"
brew "httpie"
brew "imagemagick"
brew "jj"
brew "jless"
brew "jq"
brew "kompose"
brew "lazygit"
brew "lua"
brew "maven"
brew "mysql"
brew "neovim"
brew "nmap"
brew "nushell"
brew "openjdk"
brew "pinentry"
brew "pinentry-mac"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "television"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "vivid"
brew "volta"
brew "wget"
brew "worktrunk"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "oven-sh/bun/bun"
brew "tw93/tap/mole"
brew "withgraphite/tap/graphite"
