# Santosh's awesome brewfile with Casks
tap "homebrew/bundle"
tap "homebrew/dupes"
tap "homebrew/science"
tap "caskroom/cask"
tap "caskroom/versions"

# Install first these dependencies
cask "java"
cask "xquartz"

# Shell
brew "zsh"
brew "the_silver_searcher"
brew "fasd"
brew "ripgrep"

# Git
brew "git"
brew "hub"
brew "git-flow"
brew "diff-so-fancy"

# Misc
brew "speedtest-cli"
brew "node"
brew "fzf"
brew "nginx"
brew "libyaml"
brew "go", args: ['with-cc-all']
brew "macvim", args: ['with-override-system-vim']
brew "unzip"
brew "unrar"
brew "dark-mode"
brew "youtube-dl"
brew "memcached"
brew "heroku"
brew "octave"

# DBs
brew "redis"
brew "postgresql"
brew "mongodb"
brew "mysql"

# Apache
brew "spark"
brew "hadoop"
brew "thrift"
brew "ant"
brew "maven"
brew "zookeeper"
brew "subversion"
brew "mesos"

# Linux
brew "vim", args: ['--with-override-system-vi', '--with-python', '--with-ruby']
brew "vimpager"
brew "openssh"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "tree"
brew "grep"
brew "gawk"
brew "wget"
brew "openldap"
brew "openssh"
brew "openssl"
brew "rsync"
brew "tmux"
brew "watch"
brew "htop"
brew "ack"

# C
brew "gdb"
brew "cmake"
brew "automake"

# JVM
brew "jenv"
brew "scala"
brew "sbt"

# Ruby
brew "rbenv"
brew "rbenv-default-gems"

# Python
brew "python"
brew "python3"
brew "pyenv"
brew "scons"

# Amazon
brew "aws-shell"
brew "awscli"

# Install Casks
cask "dropbox"
cask "virtualbox"
cask "evernote"
cask "vagrant"
cask "postman"
cask "docker"
cask "surge"
cask "synergy"
cask "steam"
cask "skype"
cask "slack"
cask "screenhero"
cask "vlc"

# Adobe
cask "adobe-air"
cask "adobe-acrobat-reader"

# Google
cask "google-chrome"
cask "google-drive"
cask "google-hangouts"
cask "chrome-remote-desktop-host"

# MacOS
cask "alfred"
cask "aerial"
cask "flux"
cask "the-unarchiver"
cask "cheatsheet"
cask "fantastical"
cask "bartender"
cask "boom"
cask "appcleaner"
cask "iterm2"
cask "dash"
cask "sketch"
cask "hazel"
cask "transmission"
cask "forklift"
cask "bettertouchtool"
cask "spotify"


# IDEs
cask "visual-studio-code"
cask "intellij-idea"
cask "sublime-text"

# Source control
cask "github-desktop"
cask "sourcetree"
