# Homebrew Cask applications
cask "1password"
cask "1password-cli"
cask "alcove"
cask "arc"
cask "appcleaner"
cask "balsamiq-wireframes"
cask "brave-browser"
cask "bruno"
cask "claude"
cask "cleanshot"
cask "clop"
cask "chatgpt"
cask "cursor"
cask "devtoys"
cask "discord"
cask "docker"
cask "figma"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono-nerd-font"
cask "ghostty"
cask "gpg-suite"
cask "handbrake"
cask "iina"
cask "inkscape"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "keka"
cask "legcord"
cask "loom"
cask "messenger"
cask "monitorcontrol"
cask "nordvpn"
cask "notion"
cask "numi"
cask "one-switch"
cask "pronotes"
cask "readdle-spark"
cask "raycast"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tradingview"
cask "visual-studio-code"
cask "yaak"
cask "zen"

# Homebrew formulae
brew "awscli"
brew "bat"
brew "btop"
brew "coursier"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "gh"
brew "git-delta"
brew "go"
brew "gpg"
brew "gradle"
brew "helm"
brew "httpie"
brew "imagemagick"
brew "kompose"
brew "lazygit"
brew "lua"
brew "mysql"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "openssl"
brew "pinentry"
brew "pinentry-mac"
brew "python"
brew "jq"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "speedtest-cli"
brew "sqlite"
brew "ssh-copy-id"
brew "stow"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "uv"
brew "vivid"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
