#
# .zsh_plugins.txt
#

# set up Zsh completions with plugins
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# zsh-utils
belak/zsh-utils path:editor
belak/zsh-utils path:history
belak/zsh-utils path:utility

# docker
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/docker kind:fpath

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-autosuggestions kind:defer

# Deferred Plugins
zdharma-continuum/fast-syntax-highlighting kind:defer
